11/data/attachments/f5add5adfee8e73f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_83b69bfa-14d6-4319-8bb0-2aa5560a6430</nif:username>
            <nif:friendToBeAdded>Aaron_talk_Friend_65579_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>